/* მოგესალმებით მეგობრებო ეს არის დავალება ნომერი 2. დავალების ყველა ეტაპი აღწერილია კომენტარის სახით
 * 1) შედარება
 * 3) If პირობები
 * 4) ლოგიკური ოპერატორები
 * 5) Switch 
 */


 
// 1<------- შედარება ---------#### //

const num1 = 0;
const boolean1 = false;
const num2 = 5;
const emptyString = "";
const boolean2 = false;
const text = "I'm Text";
const text2 = "0";

// ჩამოწერეთ ცვლადები რომელი არის true რომელი false
// ჩამოწერეთ ზეპირად!
// მაგ. [1, 2, 3, 4]

// >>> კოდი დაწერეთ აქ 

const isFalse = [1, 2, 4, 5];
const isTrue = [3, 6, 7];

//


// შეცვალეთ ერთი ასო რომ მიიღოთ ჭეშმარიტი დებულება
// მოკლედ ახსენით მუშაობის პრინციპი თუ რატომ იმოქმედა

console.log("abc" > "ab");
console.log(4 == "004");

/* პირველ მაგალითში abc > ah, შევცვალე მხოლოდ ერთი ასეო h-ის მაგივრად დავწერე b და შესაბამისად მივიღე 
ჭეშმარიტი დებულება. abc ნადვილად მეტია ab-ზე. 
მეორე მაგალითში 2 == "004", 2-იანი შევცვალე ციფრი 4-იანით და მიღე ჭეშმარიტი დებულება, იქედან გამომდინარე,
რომ სტრინგი "004" გადაიქცევა ციფრ 4-იანად.
*/ 


// 2.<------- ლოგიკური ოპერატორები ---------#### //

// შეამოწმეთ სრულ წლოვნებაზე და თუ მეტი ან ტოლია
// 18 წელზე შესთავაზეთ სასმელი

// >>> კოდი დაწერეთ აქ 
/*let age = prompt("რამდენი წლის ხარ?");
 if (age < 18) {
   alert("სასმელი ადრე შენთვის!");
 } else {
   alert("ინებეთ თქვენი სასმელი");
 }

//


// მოიფიქრეთ 2 if else-ის მაგალითი თქვენით

// >>> კოდი დაწერეთ აქ
let learning = prompt ("რამდენი ქულა მიიღე?");
if (learning == 10){
  alert("შენ ეს შეძელი!");
} else {
  alert("უფრო მეტი მეცადინეობა გმართებს!");
}

let number = prompt ("შეიყვანე სასურველი ციფრი: ");
if (number % 2 == 0){
  alert("ეს ციფრი ლუწია!");
} else {
  alert("ეს ციფრი კენტია");
}


// გადაიყვანეთ If ternary operator-ში მაგ. (true ? 1 : 2) 

// >>> კოდი დაწერეთ აქ
//let learning = prompt ("რამდენი ქულა მიიღე?");
(learning == 10) ? alert("შენ ეს შეძელი!") :
alert("უფრო მეტი მეცადინეობა გმართებს!");

//let number = prompt ("შეიყვანე სასურველი ციფრი: ");
(number % 2 == 0) ? alert("ეს ციფრი ლუწია!") :
alert("ეს ციფრი კენტია");*/





/*
  ჩვენ გვაქვს ოთხი ფერი რომელთაც აქვთ
  კონკრეტული ციფრები მინიჭებული (თეთრი=4, 
  წითელი=3, მწვანე=2, ლურჯი=1, შავი=0, 
  სხვა ყველა ფერი=undefinde)
*/

let colorId = 3;

// დაწერეთ if ისე, რომ როდესაც ჩვენ
// შევცვლით მაღლა განსაზღვრულ ცვლადს გავიგოთ
// ამ აიდის ფერი (ფერი გამოიტანეთ კონსოლში ტექსტის
// სახით)


// >>> კოდი დაწერეთ აქ


if (colorId == 0) {
 console.log("შავი");
} else if (colorId == 1){
  console.log("ლურჯი");
} else if (colorId == 2 ){
  console.log("მწვანე");
} else if (colorId == 3) {
  console.log("წითელი");
} else if (colorId == 4 ) {
  console.log("თეთრი");
} else {
  console.log("undefinde");
}

//



// გადაიყვანეთ If ternary operator-ში მაგ. (true ? 1 : 2) 

// >>> კოდი დაწერეთ აქ
//let colorId = 1;
(colorId==0) ? console.log("შავი") : 
(colorId==1) ? console.log("ლურჯი") :
(colorId==2) ? console.log("მწვანე") :
(colorId==3) ? console.log("წითელი") :
(colorId==4) ? console.log("თეთრი") :
console.log("undefinde");


// <------- დავალება Switch ---------#### //

// ცადეთ იგივე გააკეთოთ რაც წინა დავალებაში
// ოღონდ ამჯერად Switch-ის დახმარებით


// >>> კოდი დაწერეთ აქ
//let colorId = 0;
switch (colorId) {
  case 0 : 
    console.log("შავი");
    break;
  case  1 :
    console.log("ლურჯი");
    break;
  case  2 :
    console.log("მწვანე");
    break;
  case 3 :
    console.log("წითელი");
    break;
  case  4 :
    console.log("თეთრი");
    break;
  default:
    console.log("undefinde"); 
    break;
}





//  ||
//  ||
//  ||
// \  /
//  \/

/*
    ეს დავალება რომ ნახოთ გამოიყენეთ HTML,
    ჩვენი მიზანია ავაწყოთ ჩეთ ბოტი რომელთანაც ვისაუბრებთ
    როგორც ხედავთ დაბლა გამზადებული მაქვს კოდის გარკვეული
    ნაწილი ეს არის ფუნქცია რომელსაც მომავალში გავივლით
    კონკრეტულად ეს ფუნქცია არის რეკურსიული, რეკურსია
    არის პროცესი როდესაც ფუნქცია თავის თავს იძახებს ჩვენ კი
    იმიტომ ვიყენებთ ამას, რომ ყოველ ჯერზე როდესად რაღაცის თქმა
    დაგვჭირდება მზად იყოს სასაუბროდ ჩვენი ბოტი

    // კოდში მოათავსეთ Switch რომლითაც დააპროგნოზებთ სასაუბრო
    // სიტყვებს ააწყობთ მინი ჩათ ბოტს.
    მაგ. 
    """"
      case "გამარჯობა":
        alert("გამარჯობა");
        break;
    """"
*/
const bot = document.getElementById("bot")
bot.addEventListener("click", myFun())

function myFun() {
  let x = prompt("მე მზად არ ვარ პასუხისათვის")

  // >>> კოდი დაწერეთ აქ გამოიყენეთ Switch
  switch (x) {
    case "გამარჯობა":
      alert("გაგიმარჯოს");
      break;
    case "რამდენ თვიანია კურსი?" :
      alert("2 თვიანი");
      break;
    case "რამდენს შეადგენს სწავლის გადასახადი?" :
      alert("1500 ლარს");
      break;
    case "რომელ რივხვამდეა რეგისტრაცია?" :
      alert("24 აპრილამდე");
      break;
    case "გაიცემა თუ არა სერთიფიკატი?" :
      alert("გაიცემა ორენოვანი სერთიფიკატი");
      break;
    default:
      alert("დამატებითი ინფორმაციისათვის დაუკავშირდით ოპერატორს.");
      break;
  }

  // რეკურსიული ფუნქცია
  myFun()
}

