// <-------- კალკულატორი -------#### //

/*
    აქ უნდა შევქმნათ კალკულატორი იუზერისთვის,
    თავიდან იუზერს, prompt-ით უნდა ჩააწერინოთ ხუთი რიცხვი(და იფებით უნდა დაჩეკოთ ნამდვილად ჩაწერა თუ არა რიცხვი)
    მაგ ხუთი რიცხვის შემდეგ უნდა ჩააწერინოთ რა არითმეტიკული მოქმედება გააკეთოს ჩვენმა კალკულატორმა,
    (აქ შეუძლია ჩაწეროს მარტო '-','+','*' თუ სხვა რამეს ჩაწერს ახლიდან ამოუგდეთ სანამ არ ჩაწერს ამ სამიდან ერთ-ერთს)
    ამ პრომპტებიდან ხუთი მიღებული რიცხვი უნდა ჩასეტოთ მასივში და ერთ ცვლადში უნდა გქონდეთ რა არითმეტიკული მოქმედება უნდა ჩავატაროთ(რაც იუზერი აარჩევს).
    შემდეგ უნდა შექმნათ ფუნქცია რმელიც მიიღებს 2 პარამეტრს პირვილი იქნება მასივი და მეორე არითმეტიკული მოქმედება, და მაგ ფუნქციამ არითმეტიკული მნიშვნელობის მიხედვით უნდა
    გააკეთოს გამოთვლა თუ '+' არის უნდა ყველა მასივის ელემენტი მიამატოს ერთმანეთს(მაგ. 1 + 2 + 3 + 4 + 5) თუ "*" გაამრავლოს (მაგ. 1 * 2 * 3 * 4 * 5)
*/

// =>> კოდი დაწერეთ აქ
// კალკულატორი
/*
let number1 = prompt("შეიყვანეთ თქვენთვის სასურველი პირველი რიცხვი: ");
let number2 = prompt("შეიყვანეთ თქვენთვის სასურველი მეორე რიცხვი: ");
let number3 = prompt("შეიყვანეთ თქვენთვის სასურველი მესამე რიცხვი: ");
let number4 = prompt("შეიყვანეთ თქვენთვის სასურველი მეოთხე რიცხვი: ");
let number5 = prompt("შეიყვანეთ თქვენთვის სასურველი მეხუთე რიცხვი: ");
let aritmeticOperation = prompt("აირჩიეთ არითმეტიკული ოპერტორი: + - *");


if(number1 >= 0 || number1 <= 0 && number2 >= 0 || number2 <= 0 && number3 >= 0 || number3 <= 0 && number4 >= 0 || number4 <= 0 && number5 >= 0 || number5 <= 0){
    if (aritmeticOperation === '*'){
        alert(number1 * number2 * number3 * number4 * number5);
    } else if (aritmeticOperation === '+'){
        alert(Number(number1) + Number(number2) + Number(number3) + Number(number4) + Number(number5));
    } else if (aritmeticOperation === '-') {
        alert(Number(number1) - Number(number2) - Number(number3) - Number(number4) - Number(number5));
    }
} else {
    alert("NaN");
}*/

// <-------- თანაკვეთა -------#### //

/*
    თქვენი დავალებაა შექმნათ ფუნცქცია რომელიც აბრუნებს ახალ მასივს, მასივი კი შედგება ამ ორი მასივის თანაკვეთისგან (რომელსაც ორივე შეიცავს)
    შექმენით ორი მასივი და გამოიყენეთ იგივე ფუნქცია რომ იპოვოთ ამ ორი მასივის თანანაკვეთა
*/

const Arr1 = [1, 23, 3, 34, 54, 6];
const Arr2 = [23, 3, 123, 34, 43, 4, 41];



// =>> კოდი დაწერეთ აქ

/*const Arr3 = Arr1.filter(data => Arr2.includes(data));
console.log(Arr3);*/

// <-------- ასინქრონული ფუნქცია -------#### //

/**
 * შექმენით ასინქრონული ფუნქცია რომელიც დაითვლის ათამდე, 10 წამის განმავლობაში (1++ == 1წმ)
 */

// =>> კოდი დაწერეთ აქ

/*
function count (a) { 
    if (a > 0 && a < 10 ){
            setTimeout (() => count(a), 1000)       
    }
    console.log(a);
    ++a;
}

count(1);*/



// <-------- უდიდესი რიცხვი -------#### //

/**
 * შექმენით ისეთი ფუნქცია რომელიც დაგიბრუნებთ მიწოდებული მასივის უდიდეს რიცხვს
 */


// =>> კოდი დაწერეთ აქ

/*const arr4 = [10, 20, 30, 40, 50, 60];

function Max () {
    return Math.max(...arr4);
}

console.log(Max());*/




// <-------- პროცენტის გამოთვლა -------#### 


 //ჩვენ ვაკეთებთ პროგრამას ბანკისთვის სადაც ადამიანს ვთავაზობთ შეიყვანოს თანხა და დროის ოდენობა (თვეში). 
 //პროცენტი თვეების მიხედვით: 1-6 თვემდე 10%, 6-12 თვემდე 14%, 1წელზე ზემოთ 20%
 //გამოთვალეთ სულ რამდენი იქნება გადასახდელი პროცენტთან ერთად.

 let num = prompt("შეიყვანეთ სასურველი კრედიტის ოდენობა: ");
 let mounth = prompt("მიუთითეთ კრედიტის ხანგრძლივობა თვეებში: ");
 let result; 

 if (mounth <= 6){
    result = (((num * 10 / 100) * Number(mounth)) + Number(num));
 } else if (mounth < 6 && mounth <= 12){
    result = (((Number(num) * 14 / 100) * Number(mounth)) + Number(num));
 } else {
    result = (((Number(num) * 20 / 100) * Number(mounth)) + Number(num));
 }

 console.log(result);