/* <\ css generator />

   მოცემულია ჰტმლ ფაილი თავისი მარქაფით, დავალება მდგომარეობს შემდეგში
   უნდა დაიჭიროთ ყველა ინპუტი და შესაბამისად შეუცვალთ სტილი მთავარ კვადრატს,
   ასევე როცა რადიუსებს შეუცვლით გვერდითა სპანში უნდა გამოუტანოთ რეზულტატი.
*/

/* <\ html generator />

   აქ უნდა შექმნათ დივი ამ დივში უნდა იყოს 1 select  რომელშიც უნდა იყოს ჰტმლ თეგების სია(5 ცალი მაინც)
   (სელექტიდან მნიშვნელობის ამოღება შეიძლება ჩვეულებრივ როგორც ინპუტიდან ველიუთი)
   სელექტის გვერდით უნდა იყოს ტექსტ 2 ცალი textarea და 1 button.
   button-ზე დაჭერისას უნდა შევუქმნათ html თეგი სელექტში იქნება თეგის სახელი, 
   პირველ ტექსტარეში ტექსტი რაც ჩაიწერება მაგ თეგში,
   მეორე ტექსტ არეში უნდა ჩაწეროს ცსს სტილები,
   ბა ღილაკს რომ დააჭერს შეიქმნას თეგი იუზერის აწერილი ინფოდან.
*/